// Написать программу вычисления значения функции y = f(a)

int F(int a)
{
    return a + 1;
}
int a = 1;
int y = F(a);
Console.WriteLine(y);

//done